EA/src/Documents/РаскладкаСамовывоза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>РаскладкаСамовывоза</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтправкаСМС</xr:Item>
				<xr:Item>AccumulationRegister.ХранениеЗСЯ</xr:Item>
				<xr:Item>AccumulationRegister.МестаЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаршрутНаАптеку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗСЯ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/AccumulationRegisters/ХранениеЗСЯ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ХранениеЗСЯ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗСЯ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/AccumulationRegisters/МестаЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>МестаЗаказов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приемка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Раскладка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаршрутНаАптеку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/InformationRegisters/ПриемкаСамовывозов_РаскаладкаЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПриемкаСамовывозов_РаскаладкаЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗСЯ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаршрутНаАптеку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/Documents/МаршрутНаАптеку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>МаршрутНаАптеку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.МестаЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КоробкиСборки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коробка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Сборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/Documents/РаскладкаСамовывоза/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ХранениеЗСЯ.Записывать = Истина;
	Движения.ХранениеЗСЯ.Очистить();
	Движения.МестаЗаказов.Очистить();
	Движения.МестаЗаказов.Записывать = Истина;
	Для каждого строка из Состав цикл
		ДвижениеХЗСЯ = Движения.ХранениеЗСЯ.ДобавитьПриход();
		ДвижениеХЗСЯ.Период = Дата;
		ДвижениеХЗСЯ.Документ = Строка.Заказ;
		ДвижениеХЗСЯ.Склад = Склад;
		ДвижениеХЗСЯ.МестоЗаказа = Строка.МестоЗаказа;
		ДвижениеХЗСЯ.ЗСЯ = Строка.ЗСЯ;
		ДвижениеХЗСЯ.Количество = 1;
		
		ДвижениеМЗ = Движения.МестаЗаказов.ДобавитьРасход();
		ДвижениеМЗ.Период = Дата;
		ДвижениеМЗ.Маршрут = ПолучитьМаршрутЗаказа(Строка.Заказ);
		ДвижениеМЗ.МестоЗаказа = Строка.МестоЗаказа;
		ДвижениеМЗ.Заказ = Строка.Заказ;
		ДвижениеМЗ.Приемка = 1;
		
		
		Менеджер = РегистрыСведений.ПриемкаСамовывозов_РаскаладкаЗаказов.СоздатьМенеджерЗаписи();
		Менеджер.Сотрудник = Сотрудник;
		Менеджер.Маршрут = ДокументОснование;
		Менеджер.Заказ = Строка.Заказ;
		Менеджер.МестоЗаказа = Строка.МестоЗаказа;
		Менеджер.ЗСЯ = Строка.ЗСЯ;
		Менеджер.Удалить();	
	КонецЦикла;
	
	Движения.МестаЗаказов.Записать();
	
	МассивЗаказов = Состав.ВыгрузитьКолонку("Заказ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаЗаказовОстатки.Заказ,
	|	СУММА(МестаЗаказовОстатки.ПриемкаОстаток) КАК ПриемкаОстаток
	|ПОМЕСТИТЬ втНеРазложенныеЗаказы
	|ИЗ
	|	РегистрНакопления.МестаЗаказов.Остатки(&ГраницаВключая, Заказ В (&МассивЗаказов)) КАК МестаЗаказовОстатки
	|ГДЕ
	|	МестаЗаказовОстатки.ПриемкаОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	МестаЗаказовОстатки.Заказ
	|
	|ИМЕЮЩИЕ
	|	СУММА(МестаЗаказовОстатки.ПриемкаОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументЗаказ.Ссылка КАК Заказ
	|ИЗ
	|	Документ.Заказ КАК ДокументЗаказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНеРазложенныеЗаказы КАК втНеРазложенныеЗаказы
	|		ПО втНеРазложенныеЗаказы.Заказ = ДокументЗаказ.Ссылка
	|ГДЕ
	|	ДокументЗаказ.Ссылка В(&МассивЗаказов)
	|	И втНеРазложенныеЗаказы.Заказ ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ГраницаВключая",Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() цикл		
			СтатусыДокументов.УстановитьСтатусСборкиЗаказа(Выборка.Заказ,Ссылка,Справочники.СтатусыОбработкиЗаказа.ЗаказВТочкеСамовывоза,Сотрудник,Дата);		
		КонецЦикла;
	КонецЕсли;;

КонецПроцедуры

Функция ПолучитьМаршрутЗаказа(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутНаАптекуСостав.Ссылка КАК Маршрут
	|ИЗ
	|	Документ.МаршрутНаАптеку.Состав КАК МаршрутНаАптекуСостав
	|ГДЕ
	|	МаршрутНаАптекуСостав.Заказ = &Заказ
	|	И МаршрутНаАптекуСостав.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Возврат Выборка.Маршрут;
	КонецЦикла;
	Возврат Документы.МаршрутНаАптеку.ПустаяСсылка();
	
КонецФункции
